full_stack_blog/app/controllers/blog_controller.rb

    def create
        @blog = Blog.create(blog_params)
---
INSERT INTO "blogs" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", ""], ["content", ""], ["created_at", "2021-06-09 22:07:29.598120"], ["updated_at", "2021-06-09 22:07:29.598120"]]