crud/app/controllers/post_controller.rb

    def create
        @post = Post.create(post_params)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hi"], ["body", "bye"], ["created_at", "2021-06-09 22:50:07.736852"], ["updated_at", "2021-06-09 22:50:07.736852"]]