blog_app/app/controllers/blog_controller.rb

SELECT "posts".* FROM "posts"
---
    def index
        @index = Post.all

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        @blog = Post.find(params[:id])